{
    "x": {
        "page": "meal-delivery-app",

        "sections": [
            {
                "name": "a-little-overview",
                "order": 2,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "A little overview"
                    },
                    {
                        "type": "p",
                        "text": "Back when I worked for my start-up, I didn't have much time to care about my food habits. Started as casual tryouts, ordering food online quickly became a daily habit; this is not uncommon among most corporate millennials like me. But we can’t be blamed because after a day full of  pretend hustle-bustle, one loses the patience to stir the ladle in the pot. Meal-delivery apps to the rescue, right? Did you know Forbes estimates that online food delivery is set to supersize to a hefty $200 billion by 2025, and the users on these apps are growing by astronomical numbers year by year."
                    }
                ]
            },

            {
                "name": "a-little-overview",
                "order": 4,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": "With increasing user size, restaurants and food options keep increasing. As a result, users get flooded with a great deal of data when they open their meal delivery app of choice. There comes a time when customers ought to be presented with qualitative data or at least an easy way to filter unnecessary data."
                    },
                    {
                        "type": "p",
                        "text": ":st>Etsy for food delivery<st:"
                    },
                    {
                        "type": "p",
                        "text": "On a different note, with hundreds of restaurants trying to get into the online game, it is becoming a daunting task for local restaurants to keep their business going. So this is my attempt to design a meal-delivery app that incorporates all our local Grandma’s Bakeries and helps them connect to us millennials."
                    }
                ]
            },

            {
                "name": "problems-with-todays-food-apps",
                "order": 5,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Problems with today’s food apps"
                    },
                    {
                        "type": "p",
                        "text": "I met quite several employees from a diverse range of companies a few years ago. I interviewed twenty employees who were friendly to me and a few other co-workers. Listening to them, I could connect so much about the issues generated by these apps, and I narrowed them down to three main ones."
                    },
                    {
                        "type": "li",
                        "text": "Apps eating into a huge chunk of the Millenial’s income;;;Health degradation;;;Distracting Ads - time wasted in analysing offers"
                    }
                ]
            },

            {
                "name": "my-design-solution",
                "order": 6,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "My design solution"
                    },
                    {
                        "type": "p",
                        "text": "My app’s core design is done in steps without completely altering the traditional essence of food ordering. To begin with the process, we need to understand the behavior of the users. So to make it easier, I created two personas that collectively encompass all the food traits of the people I interviewed. Meet Millie and Walden, our 9 to 5 job-ing personas -"
                    }
                ]
            },

            {
                "name": "core-experience",
                "order": 8,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Core experience"
                    },
                    {
                        "type": "p",
                        "text": ":st>Food centric design<st:"
                    },
                    {
                        "type": "p",
                        "text": "Most users I interviewed told me that they spend a lot of time deciding what they want which annoys them. So I deduced that there are only 3 cases that reflect their state of mind when they intend to order -"
                    },
                    {
                        "type": "li",
                        "text": "I know what I want to order;;;I don’t know what to order but I feel like eating something spicy/junk/sweet;;;I have no idea what I want, so show me the options"
                    },
                    {
                        "type": "p",
                        "text": "Addressing this, the best way would be to let the user answer the question, whichever one amongst the 3 they're confronted with at the moment. And the answer would be much more evident if there are choices of food on their screen first rather than choices of restaurants. So I designed a front page with a minimalistic set of cards(without any unnecessary details) arranged in the following order - Regulars, Food Categories, Cuisines, and then Restaurants and Offers."
                    }
                ]
            },

            {
                "name": "curated-list-social-proof",
                "order": 10,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": ":st>Curated list artwork uniformity, and social proof to validate local restaurants<st:"
                    },
                    {
                        "type": "p",
                        "text": "Ongoing offers are shown right below cuisines section because for most users, offers are a crucial to determine the order. But simple restaurant-offer-posters on the screen force the user to perform involuntary and stressful calculations to buy that perfect value for money deal meal."
                    },
                    {
                        "type": "p",
                        "text": "I have intensified the offer details and added the count of availed offers in the last 24 hours so users can rely on Social Proof to choose between offers."
                    }
                ]
            },

            {
                "name": "hashtag-segregation",
                "order": 12,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": ":st>Hierarchy of elements - Hashtag-based segregation<st:"
                    },
                    {
                        "type": "p",
                        "text": "Choosing the right meal is greatly simplified if we follow the hashtag approach like Instagram or Twitter because most of the times, couch-diners are looking for the main course item which is not necessarily associated with a brand or a restaurant."
                    }
                ]
            },

            {
                "name": "hashtag-segregation",
                "order": 14,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": "The hashtag approach not only narrows down items to peculiar choices but also provides restaurants a way to market in narrow pipelines. This approach is also familiar to today’s Millenials who comprise more than 70% of meal-delivery app customers."
                    }
                ]
            },

            {
                "name": "food-rating-priority",
                "order": 16,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": ":st>Food ratings over Restaurant ratings<st:"
                    },
                    {
                        "type": "p",
                        "text": "Food ratings are more significant than restaurant ratings because even the best restaurant has only a few signature dishes which everyone likes."
                    }
                ]
            },

            {
                "name": "food-rating-priority",
                "order": 18,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": "Design for a particular category, in this case, ice cream. The page is divided into sections, arranged priority-wise. My top metrics for ranking the relevance of these sections are -"
                    }
                ]
            },

            {
                "name": "food-rating-priority",
                "order": 20,
                "textBlocks": [
                    {
                        "type": "li",
                        "text": ":st>Social proof<st: - Public favourites section which contains items ranked in an order determined by the item rating : number of ratings proportion.;;;:st>Personal preferences<st: - Previous orders are shown in My favourites section. Ratings or reviews by the user are shown as well to help them identify the item.;;;Offers on dishes/items;;;New local restaurants;;;Promoted restaurants"
                    }
                ]
            },

            {
                "name": "authenticity",
                "order": 22,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Restaurant pages - A focus on authenticity"
                    },
                    {
                        "type": "p",
                        "text": "To promote local restaurants that are genuinely great, users should be shown everything that makes a local restaurant great, like the pictures of owners and their story, where they source their ingredients from, restaurant pictures .. and so on. Customer testimonials are key in my design, no I’m not talking just about internet reviews, but the walk-in customer testimonials as well."
                    }
                ]
            },

            {
                "name": "health-and-money-tracker",
                "order": 24,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Personal health and money tracker"
                    },
                    {
                        "type": "p",
                        "text": "For explorers, health is a high priority, and so is budget-spending for couch-diners, so I designed a system that alerts users when they consume more calories or spend more money than usual."
                    }
                ]
            },

            {
                "name": "fin",
                "order": 26,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Fin."
                    }
                ]
            }
        ]
    },

    "y": {
        "page": "rain-bag",
        "sections": [
            {
                "name": "introduction",
                "order": 2,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "What's this?"
                    },

                    {
                        "type": "p",
                        "text": "An umbrella designed to fit inside your backpack that can be operated hands-free. The umbrella is removable and washable. This product was designed for Indian rural kids, planned initially as an in-house developed product by :ln>StoreKing:ln:https://storeking.in<ln: where I worked as a Product Designer."
                    }
                ]
            },

            {
                "name": "why",
                "order": 4,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "But weren't you a UX Designer?"
                    },

                    {
                        "type": "p",
                        "text": "Yes, I was. But one day I told my boss, the CEO of StoreKing, about my passion for mechanical engineering and building innovative products that solve user problems. He also shared a passion for building products that benefit society, especially in the Indian rural market. We then decided to build the Rain-Bag as a side project. If I were to build a successful prototype, we could then plan the manufacturing and sales. I took this as a challenge and dedicated a few hours every day for 6 months to it. I was able to build a working prototype, and here's my design + engineering process that went behind this project."
                    }
                ]
            },

            {
                "name": "problems",
                "order": 5,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Two main problems faced by an Indian student while commuting to school"
                    },

                    {
                        "type": "li",
                        "text": "Heavy load with many books becomes a major issue when you have to walk to school every day;;;Exposure to the hot sun and heavy rains"
                    }
                ]
            },

            {
                "name": "design-process",
                "order": 7,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "The design process"
                    },

                    {
                        "type": "p",
                        "text": ":st>Research<st:"
                    },
                    {
                        "type": "p",
                        "text": "To understand the users' requirements and get an idea of the potential for adaptability, I performed a voice of customers survey by personally visiting the rural schools of Karnataka and taking valuable inputs from children. One would be awestruck by the ideas proposed by children."
                    },
                    {
                        "type": "p",
                        "text": ":st>Ideation, concept sketches<st:"
                    }
                ]
            },

            {
                "name": "design-process",
                "order": 9,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": ":st>Building a prototype of the backpack<st:"
                    }
                ]
            },

            {
                "name": "design-process",
                "order": 11,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": "After I had built the mock backpack with flex sheet and glue, it was time to prototype it with real materials. So I approached a well-known backpack company in India, and requested the founder to let me spend two days with a few of the workers so that I could fabricate my design. I successfully do just that in their factory. The bag has a 3 cm wide opening for the umbrella assembly to slide in."
                    }
                ]
            },

            {
                "name": "designing-umbrella",
                "order": 13,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Now, the fun part. Designing and engineering the umbrella prototype"
                    },

                    {
                        "type": "p",
                        "text": "The umbrella has to open from the bag without harming the user, which was quite challenging to design. I pulled an all-nighter to design the perfect mechanism and tested it using actual umbrella parts, and some sticks made of straw."
                    }
                ]
            },

            {
                "name": "designing-umbrella",
                "order": 15,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": ":st>Figuring out the Math.<st:"
                    },

                    {
                        "type": "p",
                        "text": "Then I spent the next week modelling, calculating, rigging parts and 3D printing."
                    }
                ]
            },

            {
                "name": "designing-umbrella",
                "order": 17,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": "After I was confident with the math I did, I approached many big umbrella companies in India, but none of them believed that my mechanism would actually work. After a long stretch, one of the biggest umbrella companies in India replied saying that they wanted to explore this mechanism of mine. The founder of Sun Umbrellas generously let me use his R&D workshop, and with the help of the workers there, I finally built a fully functioning prototype of the umbrella. Here's what it looked like."
                    }
                ]
            },

            {
                "name": "closure",
                "order": 19,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "What happened then?"
                    },

                    {
                        "type": "p",
                        "text": "We then had to close the project because after calculating the manufacturing costs, it didn't quite work out. This projects remains a unique experience in my life and I am very proud of what I was able to achieve."
                    }
                ]
            },

            {
                "name": "closure",
                "order": 21,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Fin."
                    }
                ]
            }
        ]
    },

    "z": {
        "page": "glasmet",

        "sections": [
            {
                "name": "overview",
                "order": 1,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Introduction"
                    },
                    {
                        "type": "p",
                        "text": "Right after college, when I was under the impression that I would never land any job, I started sketching out a few designs for a helmet powered by Mixed Reality tech. I did some modelling in Rhino and made a concept project about it. Here's the rest of the story. Hope you enjoy it."
                    }
                ]
            },

            {
                "name": "goal",
                "order": 2,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "The Goal"
                    },
                    {
                        "type": "p",
                        "text": "The project's goal is to provide South Asian motorbike travelers with a way to access GPS navigation without having to stop and look at the phone."
                    }
                ]
            },

            {
                "name": "the-need",
                "order": 4,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "The Need"
                    },
                    {
                        "type": "p",
                        "text": "In countries like India and China where a great deal of the population commutes using a two-wheeler of some kind, there is a great need for GPS accessories to navigate while commuting. This is especially for road trips. In a car, it is not much of a hassle but if you are on a bike trip, finding your location can be very annoying - On average, you’d have to look at your phone 5 times for directions in an hour. South Asian geographies and settlements are organically spread which makes it confusing to navigate."
                    },
                    {
                        "type": "p",
                        "text": "If you are not from South Asia, just Google “Bike trips in India” and you’ll get the idea of just how many people travel thousands of kilometers on two-wheelers on a yearly fun trip."
                    },
                    {
                        "type": "p",
                        "text": "The need for GPS is so clear that you can see one of such phone holders attached to the handle of the bike on almost everyone’s two-wheeler in India -"
                    }
                ]
            },

            {
                "name": "the-need",
                "order": 6,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": "But what if you don’t have to look down often for directions while travelling on a two-wheeler? What if you get the directions on the road - like navigation in video games! Wouldn’t that be great?"
                    }
                ]
            },

            {
                "name": "ideation",
                "order": 8,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Ideation"
                    }
                ]
            },

            {
                "name": "ideation",
                "order": 10,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": "The design evolved through multiple variations as it was hard to incorporate all the functions while keeping the aesthetics intact. Ergonomics and human-centric experience were a top priority in all of the variations."
                    }
                ]
            },

            {
                "name": "the-console",
                "order": 12,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "The Console"
                    }
                ]
            },

            {
                "name": "user-interface",
                "order": 14,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "User Interface"
                    },

                    {
                        "type": "p",
                        "text": "There are 4 elements that make up for the essential functions of the Glasmet"
                    },

                    {
                        "type": "li",
                        "text": "Main menu;;;Navigation;;;Music;;;Calls"
                    }
                ]
            },

            {
                "name": "photochromatic-glass",
                "order": 16,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Photochromatic glass"
                    },

                    {
                        "type": "p",
                        "text": "A major problem for the AR glasses is excessive sunlight. So Glasmet’s protective glass has a photochromatic layer which darkens in excessive sunlight and lightens when it is not so bright."
                    }
                ]
            },

            {
                "name": "navigation-arrow",
                "order": 18,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "The Navigation arrow"
                    }
                ]
            },

            {
                "name": "navigation-arrow",
                "order": 20,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": "This guy is the real star. Navigating is so much easier when you see the arrow move left and right according to Google map’s direction APIs. The realtime movement of the arrow inspired from video games is like someone sitting on the back seat telling you left or right while driving."
                    }
                ]
            },

            {
                "name": "fin",
                "order": 22,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Fin"
                    }
                ]
            },

            {
                "name": "fin",
                "order": 24,
                "textBlocks": [
                    {
                        "type": "p",
                        "text": "Okay, there are a ton of features and specifics we can go into, but since this is only a concept project that I had thought of during college (2016), I am wrapping this up here. It is 2020 now, and I have seen companies/start-ups work on a similar concept, build a prototype and even launch on Kickstarter. However, there is not much penetration in the Indian market at least. But AR and Mixed Reality gadgets will be a cardinal thing of the future, I strongly believe it!"
                    }
                ]
            }
        ]
    },
    "a": {
        "page": "three-way-transformer",

        "sections": [
            {
                "name": "introduction",
                "order": 2,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Inspired from Transformers (Not the movies, the anime)."
                    },
                    {
                        "type": "p",
                        "text": "I used hard paper, glue, and a pair of scissors to make it. I called him Tyrex. Sorry about the cringey name, I was young and stupid."
                    }
                ]
            },

            {
                "name": "pictures",
                "order": 3,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Some pictures."
                    }
                ]
            },

            {
                "name": "fin",
                "order": 5,
                "textBlocks": [
                    {
                        "type": "h3",
                        "text": "Fin."
                    }
                ]
            }
        ]
    }
}
