{
    "page": "meal-delivery-app",
    "type": "TEXT_GROUP",
    "sections": [
        {
            "name": "a-little-overview",
            "order": 2,
            "textBlocks": [
                {
                    "type": "h3",
                    "text": "A little overview"
                },
                {
                    "type": "p",
                    "text": "Back when I worked for my start-up, I didn't have much time to care about my food habits. Started as casual tryouts, ordering food online quickly became a daily habit; this is not uncommon among most corporate millennials like me. But we can’t be blamed because after a day full of  pretend hustle-bustle, one loses the patience to stir the ladle in the pot. Meal-delivery apps to the rescue, right? Did you know Forbes estimates that online food delivery is set to supersize to a hefty $200 billion by 2025, and the users on these apps are growing by astronomical numbers year by year."
                }
            ]
        },

        {
            "name": "a-little-overview",
            "order": 4,
            "textBlocks": [
                {
                    "type": "p",
                    "text": "With increasing user size, restaurants and food options keep increasing. As a result, users get flooded with a great deal of data when they open their meal delivery app of choice. There comes a time when customers ought to be presented with qualitative data or at least an easy way to filter unnecessary data."
                },
                {
                    "type": "p",
                    "text": ":st>Etsy for food delivery<st:"
                },
                {
                    "type": "p",
                    "text": "On a different note, with hundreds of restaurants trying to get into the online game, it is becoming a daunting task for local restaurants to keep their business going. So this is my attempt to design a meal-delivery app that incorporates all our local Grandma’s Bakeries and helps them connect to us millennials."
                }
            ]
        },

        {
            "name": "problems-with-todays-food-apps",
            "order": 5,
            "textBlocks": [
                {
                    "type": "h3",
                    "text": "Problems with today’s food apps"
                },
                {
                    "type": "p",
                    "text": "I met quite several employees from a diverse range of companies a few years ago. I interviewed twenty employees who were friendly to me and a few other co-workers. Listening to them, I could connect so much about the issues generated by these apps, and I narrowed them down to three main ones."
                },
                {
                    "type": "li",
                    "text": "Apps eating into a huge chunk of the Millenial’s income;;;Health degradation;;;Distracting Ads - time wasted in analysing offers"
                }
            ]
        },

        {
            "name": "my-design-solution",
            "order": 6,
            "textBlocks": [
                {
                    "type": "h3",
                    "text": "My design solution"
                },
                {
                    "type": "p",
                    "text": "My app’s core design is done in steps without completely altering the traditional essence of food ordering. To begin with the process, we need to understand the behavior of the users. So to make it easier, I created two personas that collectively encompass all the food traits of the people I interviewed. Meet Millie and Walden, our 9 to 5 job-ing personas -"
                }
            ]
        },

        {
            "name": "core-experience",
            "order": 8,
            "textBlocks": [
                {
                    "type": "h3",
                    "text": "Core experience"
                },
                {
                    "type": "p",
                    "text": ":st>Food centric design<st:"
                },
                {
                    "type": "p",
                    "text": "Most users I interviewed told me that they spend a lot of time deciding what they want which annoys them. So I deduced that there are only 3 cases that reflect their state of mind when they intend to order -"
                },
                {
                    "type": "li",
                    "text": "I know what I want to order;;;I don’t know what to order but I feel like eating something spicy/junk/sweet;;;I have no idea what I want, so show me the options"
                },
                {
                    "type": "p",
                    "text": "Addressing this, the best way would be to let the user answer the question, whichever one amongst the 3 they're confronted with at the moment. And the answer would be much more evident if there are choices of food on their screen first rather than choices of restaurants. So I designed a front page with a minimalistic set of cards(without any unnecessary details) arranged in the following order - Regulars, Food Categories, Cuisines, and then Restaurants and Offers."
                }
            ]
        },

        {
            "name": "curated-list-social-proof",
            "order": 10,
            "textBlocks": [
                {
                    "type": "p",
                    "text": ":st>Curated list artwork uniformity, and social proof to validate local restaurants<st:"
                },
                {
                    "type": "p",
                    "text": "Ongoing offers are shown right below cuisines section because for most users, offers are a crucial to determine the order. But simple restaurant-offer-posters on the screen force the user to perform involuntary and stressful calculations to buy that perfect value for money deal meal."
                },
                {
                    "type": "p",
                    "text": "I have intensified the offer details and added the count of availed offers in the last 24 hours so users can rely on Social Proof to choose between offers."
                }
            ]
        },

        {
            "name": "hashtag-segregation",
            "order": 12,
            "textBlocks": [
                {
                    "type": "p",
                    "text": ":st>Hierarchy of elements - Hashtag-based segregation<st:"
                },
                {
                    "type": "p",
                    "text": "Choosing the right meal is greatly simplified if we follow the hashtag approach like Instagram or Twitter because most of the times, couch-diners are looking for the main course item which is not necessarily associated with a brand or a restaurant."
                }
            ]
        },

        {
            "name": "hashtag-segregation",
            "order": 14,
            "textBlocks": [
                {
                    "type": "p",
                    "text": "The hashtag approach not only narrows down items to peculiar choices but also provides restaurants a way to market in narrow pipelines. This approach is also familiar to today’s Millenials who comprise more than 70% of meal-delivery app customers."
                }
            ]
        },

        {
            "name": "food-rating-priority",
            "order": 16,
            "textBlocks": [
                {
                    "type": "p",
                    "text": ":st>Food ratings over Restaurant ratings<st:"
                },
                {
                    "type": "p",
                    "text": "Food ratings are more significant than restaurant ratings because even the best restaurant has only a few signature dishes which everyone likes."
                }
            ]
        },

        {
            "name": "food-rating-priority",
            "order": 18,
            "textBlocks": [
                {
                    "type": "p",
                    "text": "Design for a particular category, in this case, ice cream. The page is divided into sections, arranged priority-wise. My top metrics for ranking the relevance of these sections are -"
                }
            ]
        },

        {
            "name": "food-rating-priority",
            "order": 20,
            "textBlocks": [
                {
                    "type": "li",
                    "text": ":st>Social proof<st: - Public favourites section which contains items ranked in an order determined by the item rating : number of ratings proportion.;;;:st>Personal preferences<st: - Previous orders are shown in My favourites section. Ratings or reviews by the user are shown as well to help them identify the item.;;;Offers on dishes/items;;;New local restaurants;;;Promoted restaurants"
                }
            ]
        },

        {
            "name": "authenticity",
            "order": 22,
            "textBlocks": [
                {
                    "type": "h3",
                    "text": "Restaurant pages - A focus on authenticity"
                },
                {
                    "type": "p",
                    "text": "To promote local restaurants that are genuinely great, users should be shown everything that makes a local restaurant great, like the pictures of owners and their story, where they source their ingredients from, restaurant pictures .. and so on. Customer testimonials are key in my design, no I’m not talking just about internet reviews, but the walk-in customer testimonials as well."
                }
            ]
        },

        {
            "name": "health-and-money-tracker",
            "order": 24,
            "textBlocks": [
                {
                    "type": "h3",
                    "text": "Personal health and money tracker"
                },
                {
                    "type": "p",
                    "text": "For explorers, health is a high priority, and so is budget-spending for couch-diners, so I designed a system that alerts users when they consume more calories or spend more money than usual."
                }
            ]
        },

        {
            "name": "fin",
            "order": 26,
            "textBlocks": [
                {
                    "type": "h3",
                    "text": "Fin."
                }
            ]
        }
    ]
}
